In [3]:
class BaseTest(object):
    def hogehoge(self):
        raise NotImplementedError()


class Test(BaseTest):
    def hogehoge(self):
        print("hogehoge")


class Test2(BaseTest):
    pass


if __name__ == "__main__":
    test = Test()
    test.hogehoge()

    test2 = Test2()
    test2.hogehoge()

hogehoge

NotImplementedError:

In [46]:
from abc import ABCMeta, abstractmethod

class Abstract(metaclass=ABCMeta):

    def __init__(self, name):
        self.name = name

    @classmethod
    @abstractmethod
    def uppercase(cls, name):
        raise NotImplementedError()

    def explain(self):
        print(self.name)

    @abstractmethod
    def hello(self):
        raise NotImplementedError()


class Implement(Abstract):
    @classmethod
    def uppercase(cls, name):
        return name.upper() + ' by Impl'

In [49]:
if __name__ == "__main__":
    A = Implement.uppercase('a')
    print(A)
#    impl = Implement.uppercase('John')
    #impl.explain()  # JOHN by Impl
#    Implement.hello('John')  # Hello JOHN by Impl

A by Impl

In [26]:
class AbsAnimal(metaclass=ABCMeta):
    @abstractmethod
    def eat(self):
        pass

class Human(AbsAnimal):
    def eat(self):
        print('おいしい!')

tmp = Human()
#tmp.eat()

In [1]:
import bubbles

ModuleNotFoundError: No module named 'bubbles'

In [49]:
import pandas as pd
test = {'AAA':[(1,2,'a'),(2,3,'b'),(5,6,'c'),(7,8,'d')],'BBB':[(22,33,'aa'),(55,66,'bb')]}

In [59]:
lst = {}
name = ['a', 'b','c']
for k, v in test.items():
    print(k)
    for name, v in zip(name, v):
        print(name, v)

AAA
a (1, 2, 'a')
b (2, 3, 'b')
c (5, 6, 'c')
BBB
c (22, 33, 'aa')

In [54]:
AAA = [v for k, v in test.items() if k == 'AAA']

In [55]:
AAA

[[(1, 2, 'a'), (2, 3, 'b'), (5, 6, 'c'), (7, 8, 'd')]]

In [56]:
names = ['Alice', 'Bob', 'Charlie']
ages = [24, 50, 18]

for name, age in zip(names, ages):
    print(name, age)
# Alice 24
# Bob 50
# Charlie 18

Alice 24
Bob 50
Charlie 18

In [60]:
d = { str(x):x*3 for x in range(10) }

In [61]:
d

{'0': 0,
 '1': 3,
 '2': 6,
 '3': 9,
 '4': 12,
 '5': 15,
 '6': 18,
 '7': 21,
 '8': 24,
 '9': 27}

In [93]:
lst = {}
name = ['a', 'b','c']
for k, v in test.items():
    print(list(v))
    lst[k] = {k:{'a':p[0],'b':p[1],'c':p[2]} for p in v }

[(1, 2, 'a'), (2, 3, 'b'), (5, 6, 'c'), (7, 8, 'd')]
[(22, 33, 'aa'), (55, 66, 'bb')]

In [94]:
lst

{'AAA': {'AAA': {'a': 7, 'b': 8, 'c': 'd'}},
 'BBB': {'BBB': {'a': 55, 'b': 66, 'c': 'bb'}}}

In [76]:
test

{'AAA': [(1, 2, 'a'), (2, 3, 'b'), (5, 6, 'c'), (7, 8, 'd')],
 'BBB': [(22, 33, 'aa'), (55, 66, 'bb')]}

In [178]:
import pandas as pd

testa = pd.DataFrame({'A': [1, 2, 3],
                   'B': [12, 2, 3],
                   'C': [13, 2, 3]},
                  index=['ONE', 'TWO', 'THREE'])

testb = pd.DataFrame({'A': [1, 2, 3],
                   'D': [1, 2, 5],
                   'E': [1, 3, 6]},
                  index=['ONE', 'TWO', 'THREE'])

In [179]:
testa

       A   B   C
ONE    1  12  13
TWO    2   2   2
THREE  3   3   3

In [180]:
testb

       A  D  E
ONE    1  1  1
TWO    2  2  3
THREE  3  5  6

In [181]:
testc = pd.merge(testa, testb, on='A')

In [182]:
testc

   A   B   C  D  E
0  1  12  13  1  1
1  2   2   2  2  3
2  3   3   3  5  6

In [183]:
def cal_t(m,a, b ,c, d, e, n):
    a = m[a]
    b = m[b]
    c = m[c]
    d = m[d]
    e = m[e]
    if a > 15:
        rtn = n * (d +b+c)
    else:
        rtn = n * (b + c) + e*d
    return rtn

In [184]:
testc['N'] = testc.apply(cal_t,  axis = 1, args = ('A', 'B', 'C', 'D', 'E',10))

In [185]:
testc

   A   B   C  D  E    N
0  1  12  13  1  1  251
1  2   2   2  2  3   46
2  3   3   3  5  6   90

In [140]:
m = cal(1,2,3,4,5,6)

In [141]:
m

62

In [ ]:
df['TimeInterval'] = df.apply(getInterval_new , axis = 1, args = ('ReceivedTime','PublishedTime'))

In [72]:
import numpy as np
import pandas as pd


# df = pd.DataFrame(np.arange(12.0, 32.0).reshape((5, 4)), index=["a", "b", "c", "d", "e"], columns=["WW", "XX", "YY", "ZZ"])

df = pd.DataFrame({'A': [-20, -10, 0, 10, 20],
                   'B': ['2017-12-01 12:24', '2017-11-01 12:24', '2017-11-01 12:24', '2017-11-01 12:24', np.nan],
                   'C': ['2017-12-11 12:24', '2017-11-01 12:24', np.nan, np.nan, np.nan],
                   'D': ['2017-11-01 12:24', '2017-12-01 12:24', '2017-11-01 12:24', np.nan, np.nan]})

df

    A                 B                 C                 D
0 -20  2017-12-01 12:24  2017-12-11 12:24  2017-11-01 12:24
1 -10  2017-11-01 12:24  2017-11-01 12:24  2017-12-01 12:24
2   0  2017-11-01 12:24               NaN  2017-11-01 12:24
3  10  2017-11-01 12:24               NaN               NaN
4  20               NaN               NaN               NaN

In [73]:
df['E'] = pd.to_datetime(df['B'])
df['F'] = pd.to_datetime(df['C'])
df['G'] = pd.to_datetime(df['D'])

In [74]:
df

,A,B,C,D,E,F,G
0,-20,2017-12-01 12:24,2017-12-11 12:24,2017-11-01 12:24,2017-12-01 12:24:00,2017-12-11 12:24:00,2017-11-01 12:24:00
1,-10,2017-11-01 12:24,2017-11-01 12:24,2017-12-01 12:24,2017-11-01 12:24:00,2017-11-01 12:24:00,2017-12-01 12:24:00
2,0,2017-11-01 12:24,NaN,2017-11-01 12:24,2017-11-01 12:24:00,NaT,2017-11-01 12:24:00
3,10,2017-11-01 12:24,NaN,NaN,2017-11-01 12:24:00,NaT,NaT
4,20,NaN,NaN,NaN,NaT,NaT,NaT

In [79]:
# df['max'] = np.vstack([df['E'],df['F']]).max(axis =0)
df['max'] = np.vstack([df['E'],df['F'],df['G']]).max(axis =0)

In [80]:
df

,A,B,C,D,E,F,G,max
0,-20,2017-12-01 12:24,2017-12-11 12:24,2017-11-01 12:24,2017-12-01 12:24:00,2017-12-11 12:24:00,2017-11-01 12:24:00,2017-12-11 12:24:00
1,-10,2017-11-01 12:24,2017-11-01 12:24,2017-12-01 12:24,2017-11-01 12:24:00,2017-11-01 12:24:00,2017-12-01 12:24:00,2017-12-01 12:24:00
2,0,2017-11-01 12:24,NaN,2017-11-01 12:24,2017-11-01 12:24:00,NaT,2017-11-01 12:24:00,2017-11-01 12:24:00
3,10,2017-11-01 12:24,NaN,NaN,2017-11-01 12:24:00,NaT,NaT,2017-11-01 12:24:00
4,20,NaN,NaN,NaN,NaT,NaT,NaT,NaT